[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/4pwk7XR/great-gatsby-book.png",
    "review": "The Great Gatsby is a timeless classic that delves into the lives of the rich and glamorous during the Jazz Age. Fitzgerald's prose is poetic and evocative, painting a vivid picture of the opulence and decadence of the era. The story follows Jay Gatsby, a mysterious millionaire, as he pursues his lost love, Daisy Buchanan, amidst the backdrop of extravagant parties and societal upheaval. Themes of love, wealth, and the American Dream are expertly woven into the narrative, making it a compelling and thought-provoking read.",
    "totalPages": 180,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Classic", "Romance"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/VtK9BCw/To-Kill-a-Mockingbird.png",
    "review": "To Kill a Mockingbird is a poignant exploration of racial injustice and moral growth in the American South. Set against the backdrop of the Great Depression, Harper Lee's masterpiece follows the journey of young Scout Finch as she navigates the complexities of her community and witnesses her father, Atticus Finch, defend a black man wrongly accused of rape. Through Scout's eyes, Lee confronts themes of prejudice, empathy, and the loss of innocence, leaving readers with a profound understanding of the human condition.",
    "totalPages": 281,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Classic", "Social Justice"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "Brave New World",
    "author": "Aldous Huxley",
    "image": "https://i.ibb.co/wNYkGbK/Brave-New-World.png",
    "review": "Aldous Huxley's 'Brave New World' is a dystopian masterpiece that explores the perils of a utopian society built on conformity and control. Set in a future world where humans are engineered and conditioned for specific roles, the novel follows the journey of Bernard Marx as he questions the limits of individuality and freedom. Huxley's prophetic vision of a technologically advanced but spiritually bankrupt world continues to resonate with readers.",
    "totalPages": 288,
    "rating": 4.7,
    "category": "Dystopian",
    "tags": ["Social Engineering", "Conformity"],
    "publisher": "Chatto & Windus",
    "yearOfPublishing": 1932
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/v4Wr21k/Pride-and-Prejudice.png",
    "review": "Pride and Prejudice is a delightful comedy of manners that follows the romantic entanglements of the Bennet sisters in Georgian England. Jane Austen's wit and social commentary shine through as the headstrong Elizabeth Bennet clashes with the proud Mr. Darcy, leading to misunderstandings and eventual love. Through Austen's sharp observations of society and human nature, Pride and Prejudice remains a timeless tale of love, marriage, and the importance of first impressions.",
    "totalPages": 279,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Romance", "Classic"],
    "publisher": "T. Emerson, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/1XHxCmB/The-Catcher-in-the-Rye.png",
    "review": "The Catcher in the Rye is a seminal coming-of-age novel that captures the angst and alienation of adolescence. J.D. Salinger's protagonist, Holden Caulfield, narrates his experiences after being expelled from prep school, grappling with themes of identity, authenticity, and societal expectations. Through Holden's cynical yet vulnerable voice, Salinger creates a poignant portrayal of youth on the brink of adulthood, resonating with readers of all generations.",
    "totalPages": 277,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Coming-of-age", "Literary"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/MBR5DNQ/The-Lord-of-the-Rings.png",
    "review": "The Lord of the Rings is a sweeping epic fantasy that transports readers to the enchanting world of Middle-earth. J.R.R. Tolkien's masterful storytelling weaves together the fates of hobbits, wizards, elves, dwarves, and men in a struggle against the dark lord Sauron. Filled with adventure, heroism, and themes of friendship and sacrifice, this timeless tale continues to captivate audiences worldwide, earning its place as a cornerstone of fantasy literature.",
    "totalPages": 1178,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Epic", "Adventure"],
    "publisher": "George Allen & Unwit",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 7,
    "bookName": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "image": "https://i.ibb.co/WzxjH7Q/hitchhikers-guide-to-the-galaxy-removebg-preview.png",
    "review": "The Hitchhiker's Guide to the Galaxy is a hilarious and irreverent science fiction comedy that follows the misadventures of Arthur Dent after Earth is destroyed to make way for an intergalactic highway. Douglas Adams' wit and satire shine through as Arthur embarks on a journey across the cosmos accompanied by his alien friend Ford Prefect and the enigmatic guidebook for hitchhikers. With its absurd humor and philosophical undertones, this cult classic is a must-read for fans of science fiction and comedy alike.",
    "totalPages": 193,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Humor", "Satire"],
    "publisher": "Pan Books",
    "yearOfPublishing": 1979
  },
  {
    "bookId": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Concho",
    "image": "https://i.ibb.co/ZmDzp40/The-Alchemist.png",
    "review": "Paulo Concho's 'The Alchemist' is a philosophical fable about the journey of self-discovery and personal legend. The protagonist, Santiago, embarks on a quest for treasure that leads him to discover the true meaning of life and fulfillment. Coelho's lyrical prose and timeless wisdom make this novel a beloved classic that inspires readers to pursue their dreams.",
    "totalPages": 208,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Philosophy", "Spirituality"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 9,
    "bookName": "The Road",
    "author": "Cormac McCarthy",
    "image": "https://i.ibb.co/hMP19wn/The-Road.png",
    "review": "Cormac McCarthy's 'The Road' is a haunting post-apocalyptic novel that explores the depths of human despair and resilience. Set in a barren, ash-covered world, a father and his young son journey towards the coast in search of hope amidst the devastation. McCarthy's spare prose and stark imagery convey the bleakness of their existence while highlighting the enduring power of love and compassion.",
    "totalPages": 287,
    "rating": 4.4,
    "category": "Dystopian",
    "tags": ["Survival", "Father-Son Relationship"],
    "publisher": "Alfred A. Knopf",
    "yearOfPublishing": 2006
  },
  {
    "bookId": 10,
    "bookName": "Moby-Dick",
    "author": "Herman Melville",
    "image": "https://i.ibb.co/tpNVfhT/Moby-Dick.png",
    "review": "Herman Melville's 'Moby-Dick' is an epic tale of obsession and revenge set against the backdrop of the whaling industry. Narrated by the sailor Ishmael, the novel follows Captain Ahab's relentless pursuit of the elusive white whale, Moby Dick. Melville's rich prose and philosophical reflections on the human condition elevate this seafaring adventure into a timeless literary masterpiece.",
    "totalPages": 624,
    "rating": 4.4,
    "category": "Classic",
    "tags": ["Adventure", "Whaling"],
    "publisher": "Richard Bentley",
    "yearOfPublishing": 1851
  },
  {
    "bookId": 11,
    "bookName": "The Brothers Karamazov",
    "author": "Fyodor Dostoevsky",
    "image": "https://i.ibb.co/7nTnXys/The-Brothers-Karamazov.png",
    "review": "Fyodor Dostoevsky's 'The Brothers Karamazov' is a monumental work of Russian literature that delves into the depths of the human soul and the nature of morality. Through the complex relationships of the Karamazov family, Dostoevsky explores themes of faith, doubt, and the search for meaning in a world marked by suffering and injustice. With its profound insights and existential dilemmas, this novel remains a profound and enduring masterpiece.",
    "totalPages": 796,
    "rating": 4.9,
    "category": "Classic",
    "tags": ["Philosophy", "Family Drama"],
    "publisher": "The Russian Messenger",
    "yearOfPublishing": 1880
  }
]
